import os

CHANNEL_ID = -69249541461431
MAX_BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")
BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")

# --- ССЫЛКИ ---
CHANNEL_URL = "https://max.ru/id3015022098_gos"
SITE_URL = "https://rowingschool.ru"
FORM_URL = "https://pos.gosuslugi.ru/landing/"

# --- ТЕКСТЫ ---
TEXT_SUBSCRIBE = (
    "Для того чтобы продолжить использовать бот, необходимо подписаться на канал\n"
    "«ГКУ ДО АО «СШОР им. В.В. Тихонова».\n\n"
    "Для этого нажмите «Открыть канал» или перейдите по ссылке:\n"
    f"{CHANNEL_URL}\n\n"
    "Затем вернитесь в чат-бот и нажмите «Я подписан»."
)

TEXT_WELCOME = (
    "Добро пожаловать в чат-бот ГКУ ДО АО «СШОР им. В.В. Тихонова»!\n\n"
    "Выберите нужную категорию:"
)

TEXT_ABOUT = (
    "Государственное казенное учреждение Астраханской области «Спортивная школа олимпийского резерва им. В.В. Тихонова» по гребному спорту была открыта городским отделом народного образования в 1971 году как ДЮСШ №6 по гребле на байдарках и каноэ с целью продолжения славных традиций и успехов астраханских гребцов на всесоюзной и международной арене в 1960-70 годы.\n"
)

TEXT_ADDRESSES = (
    "📍 **Адрес школы**\n"
    "• г. Астрахань ул. Красная Набережная 227А\n"
    "📍 **Тренировочные базы**\n"
    "• г. Астрахань, ул. Красная Набережная, 227Б\n"
    "• г. Астрахань, ул. Набережная Золотого затона, 2\n"
)

TEXT_PAID_SERVICES = (
    "💳 **Платные услуги**\n\n"
    "Здесь описаны платные услуги центра. Подробнее — на официальном сайте."
)

TEXT_CONTACTS = (
    "📞 **Справочная информация**\n\n"
    "• Телефон: +7 (8512) 24-25-56\n"
    "• Email: gku@sshortihonova.astrobl.ru\n"
    "• Режим работы: пн–вс, 8:30–17:30"
)

TEXT_SUPPORT_MENU = (
    "❓ **Часто задаваемые вопросы**\n\n"
    "Выберите направление:"
)

SUPPORT_DATA = {
    "question_1": (
        "✅ **Ответ:**\n\n"
        "По дисциплинам: гребля на байдарках и каноэ, гребля на лодках «Дракон», минимальный возраст для зачисления 9 лет\n"
        "По дисциплинам: академическая гребля, дисциплина-гребля-индор, минимальный возраст для зачисления 10 лет\n"
        "**Для зачисления в группу дети должны уметь плавать и не иметь медицинских противопоказаний к занятиям.**"
    ),
    "question_2": (
        "✅ **Ответ:**\n\n"
        "В учреждении реализуются:\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «Гребля на байдарках и каноэ» (дисциплины: гребля на байдарках и каноэ, гребля на лодках «Дракон»);\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «Гребной спорт» (дисциплина - академическая гребля, дисциплина-гребля-индор).\n"
    ),
    "question_3": (
        "✅ **Ответ:**\n\n"
        "• Гребля на байдарках и каноэ;\n"
        "• Гребной спорт.\n"
    ),
    "question_4": (
        "✅ **Ответ:**\n\n"
        "Пять направлений:\n"
        "• Гребля на байдарке;\n"
        "• Гребля на каноэ;\n"
        "• Гребля на лодках «Дракон»;\n"
        "• Гребля-индор;\n"
        "• Гребной спорт (дисциплина - Академическая гребля).\n"
    ),
}
